package io.inprice.scrapper.api.utils;

import java.util.HashMap;
import java.util.Map;

public class CurrencyFormats {

  private static final Map<String, String> map;

  static {
    map = new HashMap<>(155);
    map.put("AED", "د.إ.‏ #,###.00;د.إ.‏ -#,###.00");
    map.put("AFN", "؋#,###.00;؋-#,###.00");
    map.put("ALL", "#.###,00Lek;-#.###,00Lek");
    map.put("AMD", "#,###.00 ֏;-#,###.00 ֏");
    map.put("ANG", "ƒ#,###.00;ƒ-#,###.00");
    map.put("AOA", "Kz#,###.00;Kz-#,###.00");
    map.put("ARS", "$ #.###,00;$ -#.###,00");
    map.put("AUD", "$#,###.00;$-#,###.00");
    map.put("AWG", "ƒ#,###.00;ƒ-#,###.00");
    map.put("AZN", "#.###,00 ₼;-#.###,00 ₼");
    map.put("BAM", "#.###,00 КМ;-#.###,00 КМ");
    map.put("BBD", "$#,###.00;$-#,###.00");
    map.put("BDT", "৳ #,###;৳ -#,###");
    map.put("BGN", "#.###,00 лв.;-#.###,00 лв.");
    map.put("BHD", "د.ب.‏ #,###.000;د.ب.‏ -#,###.000");
    map.put("BIF", "#,###FBu;-#,###FBu");
    map.put("BMD", "$#,###.00;$-#,###.00");
    map.put("BND", "$#.###;$-#.###");
    map.put("BOB", "Bs #.###,00;Bs -#.###,00");
    map.put("BRL", "R$ #.###,00;R$ -#.###,00");
    map.put("BSD", "$#,###.00;$-#,###.00");
    map.put("BTC", "#,###.Ƀ;-#,###.Ƀ");
    map.put("BTN", "Nu. #,###.0;Nu. -#,###.0");
    map.put("BWP", "P#,###.00;P-#,###.00");
    map.put("BYR", "#.###,00 р.;-#.###,00 р.");
    map.put("BZD", "BZ$#,###.00;BZ$-#,###.00");
    map.put("CAD", "$#,###.00;$-#,###.00");
    map.put("CDF", "#,###.00FC;-#,###.00FC");
    map.put("CHF", "CHF # ###.00;CHF -# ###.00");
    map.put("CLP", "$ #.###,00;$ -#.###,00");
    map.put("CNY", "¥#,###.00;¥-#,###.00");
    map.put("COP", "$ #.###,00;$ -#.###,00");
    map.put("CRC", "₡#.###,00;₡-#.###,00");
    map.put("CUC", "CUC#,###.00;CUC-#,###.00");
    map.put("CUP", "$MN#,###.00;$MN-#,###.00");
    map.put("CVE", "$#,###.00;$-#,###.00");
    map.put("CZK", "#.###,00 Kč;-#.###,00 Kč");
    map.put("DJF", "#,###Fdj;-#,###Fdj");
    map.put("DKK", "#.###,00 kr.;-#.###,00 kr.");
    map.put("DOP", "RD$#,###.00;RD$-#,###.00");
    map.put("DZD", "د.ج.‏ #,###.00;د.ج.‏ -#,###.00");
    map.put("EGP", "ج.م.‏ #,###.00;ج.م.‏ -#,###.00");
    map.put("ERN", "#,###.00Nfk;-#,###.00Nfk");
    map.put("ETB", "ETB#,###.00;ETB-#,###.00");
    map.put("EUR", "#.###,00 €;-#.###,00 €");
    map.put("FJD", "$#,###.00;$-#,###.00");
    map.put("FKP", "£#,###.00;£-#,###.00");
    map.put("GBP", "£#,###.00;£-#,###.00");
    map.put("GEL", "#.###,00 Lari;-#.###,00 Lari");
    map.put("GHS", "₵#,###.00;₵-#,###.00");
    map.put("GIP", "£#,###.00;£-#,###.00");
    map.put("GMD", "#,###.00D;-#,###.00D");
    map.put("GNF", "#,###FG;-#,###FG");
    map.put("GTQ", "Q#,###.00;Q-#,###.00");
    map.put("GYD", "$#,###.00;$-#,###.00");
    map.put("HKD", "HK$#,###.00;HK$-#,###.00");
    map.put("HNL", "L. #,###.00;L. -#,###.00");
    map.put("HRK", "#.###,00 kn;-#.###,00 kn");
    map.put("HTG", "G#,###.00;G-#,###.00");
    map.put("HUF", "#.###,00 Ft;-#.###,00 Ft");
    map.put("IDR", "Rp#.###;Rp-#.###");
    map.put("ILS", "₪ #,###.00;₪ -#,###.00");
    map.put("INR", "₹#,###.00;₹-#,###.00");
    map.put("IQD", "د.ع.‏ #,###.00;د.ع.‏ -#,###.00");
    map.put("IRR", "﷼ #,###/00;﷼ -#,###/00");
    map.put("ISK", "#.### kr.;-#.### kr.");
    map.put("JMD", "J$#,###.00;J$-#,###.00");
    map.put("JOD", "د.ا.‏ #,###.000;د.ا.‏ -#,###.000");
    map.put("JPY", "¥#,###;¥-#,###");
    map.put("KES", "KSh#,###.00;KSh-#,###.00");
    map.put("KGS", "#.###-00 сом;-#.###-00 сом");
    map.put("KHR", "#,###៛;-#,###៛");
    map.put("KMF", "#,###.00CF;-#,###.00CF");
    map.put("KPW", "₩#,###;₩-#,###");
    map.put("KRW", "₩#,###;₩-#,###");
    map.put("KWD", "د.ك.‏ #,###.000;د.ك.‏ -#,###.000");
    map.put("KYD", "$#,###.00;$-#,###.00");
    map.put("KZT", "₸#.###-00;₸-#.###-00");
    map.put("LAK", "#,###₭;-#,###₭");
    map.put("LBP", "ل.ل.‏ #,###.00;ل.ل.‏ -#,###.00");
    map.put("LKR", "₨ #,###;₨ -#,###");
    map.put("LRD", "$#,###.00;$-#,###.00");
    map.put("LSL", "#,###.00M;-#,###.00M");
    map.put("LYD", "د.ل.‏#,###.000;د.ل.‏-#,###.000");
    map.put("MAD", "د.م.‏ #,###.00;د.م.‏ -#,###.00");
    map.put("MDL", "#,###.00 lei;-#,###.00 lei");
    map.put("MGA", "Ar#,###;Ar-#,###");
    map.put("MKD", "#.###,00 ден.;-#.###,00 ден.");
    map.put("MMK", "K#,###.00;K-#,###.00");
    map.put("MNT", "₮#.###,00;₮-#.###,00");
    map.put("MOP", "MOP$#,###.00;MOP$-#,###.00");
    map.put("MRO", "#,###.00UM;-#,###.00UM");
    map.put("MUR", "₨#,###.00;₨-#,###.00");
    map.put("MVR", "#,###.0 MVR;-#,###.0 MVR");
    map.put("MWK", "MK#,###.00;MK-#,###.00");
    map.put("MXN", "$#,###.00;$-#,###.00");
    map.put("MYR", "RM#,###.00;RM-#,###.00");
    map.put("MZN", "MT#,###;MT-#,###");
    map.put("NAD", "$#,###.00;$-#,###.00");
    map.put("NGN", "₦#,###.00;₦-#,###.00");
    map.put("NIO", "C$ #,###.00;C$ -#,###.00");
    map.put("NOK", "kr #.###,00;kr -#.###,00");
    map.put("NPR", "₨#,###.00;₨-#,###.00");
    map.put("NZD", "$#,###.00;$-#,###.00");
    map.put("OMR", "﷼ #,###.000;﷼ -#,###.000");
    map.put("PAB", "B/. #,###.00;B/. -#,###.00");
    map.put("PEN", "S/. #,###.00;S/. -#,###.00");
    map.put("PGK", "K#,###.00;K-#,###.00");
    map.put("PHP", "₱#,###.00;₱-#,###.00");
    map.put("PKR", "₨#,###.00;₨-#,###.00");
    map.put("PLN", "#.###,00 zł;-#.###,00 zł");
    map.put("PYG", "₲ #.###,00;₲ -#.###,00");
    map.put("QAR", "﷼ #,###.00;﷼ -#,###.00");
    map.put("RON", "#.###,00 lei;-#.###,00 lei");
    map.put("RSD", "#.###,00 Дин.;-#.###,00 Дин.");
    map.put("RUB", "#.###,00 ₽;-#.###,00 ₽");
    map.put("RWF", "RWF #.###,00;RWF -#.###,00");
    map.put("SAR", "﷼ #,###.00;﷼ -#,###.00");
    map.put("SBD", "$#,###.00;$-#,###.00");
    map.put("SCR", "₨#,###.00;₨-#,###.00");
    map.put("SDG", "£‏#,###.00;£‏-#,###.00");
    map.put("SEK", "#.###,00 kr;-#.###,00 kr");
    map.put("SGD", "$#,###.00;$-#,###.00");
    map.put("SHP", "£#,###.00;£-#,###.00");
    map.put("SLL", "Le#,###.00;Le-#,###.00");
    map.put("SOS", "S#,###.00;S-#,###.00");
    map.put("SRD", "$#,###.00;$-#,###.00");
    map.put("STD", "Db#,###.00;Db-#,###.00");
    map.put("SVC", "₡#,###.00;₡-#,###.00");
    map.put("SYP", "£ #,###.00;£ -#,###.00");
    map.put("SZL", "E#,###.00;E-#,###.00");
    map.put("THB", "฿#,###.00;฿-#,###.00");
    map.put("TJS", "#.###;00 TJS;-#.###;00 TJS");
    map.put("TMT", "#.###m;-#.###m");
    map.put("TND", "د.ت.‏ #,###.000;د.ت.‏ -#,###.000");
    map.put("TOP", "T$#,###.00;T$-#,###.00");
    map.put("TRY", "#,###.00 TL;-#,###.00 TL");
    map.put("TTD", "TT$#,###.00;TT$-#,###.00");
    map.put("TWD", "NT$#,###.00;NT$-#,###.00");
    map.put("TZS", "TSh#,###.00;TSh-#,###.00");
    map.put("UAH", "#.###,00₴;-#.###,00₴");
    map.put("UGX", "USh#,###.00;USh-#,###.00");
    map.put("USD", "$#,###.00;$-#,###.00");
    map.put("UYU", "$U #.###,00;$U -#.###,00");
    map.put("UZS", "#.###,00 сўм;-#.###,00 сўм");
    map.put("VEF", "Bs. F. #.###,00;Bs. F. -#.###,00");
    map.put("VND", "#.### ₫;-#.### ₫");
    map.put("VUV", "#,###VT;-#,###VT");
    map.put("WST", "WS$#,###.00;WS$-#,###.00");
    map.put("XAF", "#,###.00F;-#,###.00F");
    map.put("XCD", "$#,###.00;$-#,###.00");
    map.put("XOF", "#.###,00F;-#.###,00F");
    map.put("XPF", "#,###.00F;-#,###.00F");
    map.put("YER", "﷼ #,###.00;﷼ -#,###.00");
    map.put("ZAR", "R#.###,00;R-#.###,00");
    map.put("ZMW", "ZK#,###.00;ZK-#,###.00");
  }

  /**
   * Returns currency format
   * 
   * @param code
   * @return format
   */
  public static String get(String code) {
    return map.get(code);
  }
  
}